#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
```
Success! The configuration is valid.



```
#### Terraform Plan 📖`pending changes!`

<details><summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vault-deploy.cloudflare_origin_ca_certificate.vault-cforigin-tls will be created
  + resource "cloudflare_origin_ca_certificate" "vault-cforigin-tls" {
      + certificate        = (known after apply)
      + csr                = (known after apply)
      + expires_on         = (known after apply)
      + hostnames          = [
          + "vault.jtcressy.net",
        ]
      + id                 = (known after apply)
      + request_type       = "origin-rsa"
      + requested_validity = 365
    }

  # module.vault-deploy.google_cloud_run_service.vault will be created
  + resource "google_cloud_run_service" "vault" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "vault"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = "jtcressy-net-235001"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale" = "1"
                  + "run.googleapis.com/sandbox"       = "gvisor"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = 80
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + args    = [
                      + "server",
                    ]
                  + command = [
                      + "/usr/local/bin/docker-entrypoint.sh",
                    ]
                  + image   = "us.gcr.io/jtcressy-net-235001/vault:1.10.2"

                  + env {
                      + name  = "SKIP_SETCAP"
                      + value = "true"
                    }
                  + env {
                      + name  = "VAULT_API_ADDR"
                      + value = "https://vault.jtcressy.net"
                    }
                  + env {
                      + name  = "VAULT_LOCAL_CONFIG"
                      + value = jsonencode(
                            {
                              + default_lease_ttl = "168h"
                              + disable_mlock     = true
                              + listener          = {
                                  + tcp = {
                                      + address         = "0.0.0.0:8080"
                                      + tls_cert_file   = "/tls-cert/tls.crt"
                                      + tls_disable     = 0
                                      + tls_key_file    = "/tls-key/tls.key"
                                      + tls_min_version = "tls13"
                                    }
                                }
                              + log_format        = "json"
                              + log_level         = "ERROR"
                              + max_lease_ttl     = "720h"
                              + seal              = {
                                  + gcpckms = {
                                      + crypto_key = "vault-key"
                                      + key_ring   = "vault-production"
                                      + project    = "jtcressy-net-235001"
                                      + region     = "global"
                                    }
                                }
                              + storage           = {
                                  + gcs = {
                                      + bucket = "vault-jtcressy-net"
                                    }
                                }
                              + ui                = true
                            }
                        )
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "256Mi"
                        }
                    }

                  + volume_mounts {
                      + mount_path = "/tls-cert"
                      + name       = "tls-cert"
                    }
                  + volume_mounts {
                      + mount_path = "/tls-key"
                      + name       = "tls-key"
                    }
                }

              + volumes {
                  + name = "tls-cert"

                  + secret {
                      + default_mode = 292
                      + secret_name  = "vault-tls-cert"

                      + items {
                          + key  = "latest"
                          + mode = 256
                          + path = "tls.crt"
                        }
                    }
                }
              + volumes {
                  + name = "tls-key"

                  + secret {
                      + default_mode = 292
                      + secret_name  = "vault-tls-key"

                      + items {
                          + key  = "latest"
                          + mode = 256
                          + path = "tls.key"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.vault-deploy.google_cloud_run_service_iam_policy.noauth will be created
  + resource "google_cloud_run_service_iam_policy" "noauth" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "us-central1"
      + policy_data = jsonencode(
            {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
      + project     = (known after apply)
      + service     = "vault"
    }

  # module.vault-deploy.google_kms_crypto_key.vault will be created
  + resource "google_kms_crypto_key" "vault" {
      + destroy_scheduled_duration = (known after apply)
      + id                         = (known after apply)
      + import_only                = (known after apply)
      + key_ring                   = (known after apply)
      + name                       = "vault-key"
      + purpose                    = "ENCRYPT_DECRYPT"
      + rotation_period            = "31536000s"

      + version_template {
          + algorithm        = (known after apply)
          + protection_level = (known after apply)
        }
    }

  # module.vault-deploy.google_kms_key_ring.vault-production will be created
  + resource "google_kms_key_ring" "vault-production" {
      + id       = (known after apply)
      + location = "global"
      + name     = "vault-production"
      + project  = (known after apply)
    }

  # module.vault-deploy.google_kms_key_ring_iam_member.vault will be created
  + resource "google_kms_key_ring_iam_member" "vault" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + key_ring_id = (known after apply)
      + member      = (known after apply)
      + role        = "roles/owner"
    }

  # module.vault-deploy.google_secret_manager_secret.vault-tls-cert will be created
  + resource "google_secret_manager_secret" "vault-tls-cert" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "vault-tls-cert"

      + replication {
          + automatic = true
        }
    }

  # module.vault-deploy.google_secret_manager_secret.vault-tls-key will be created
  + resource "google_secret_manager_secret" "vault-tls-key" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "vault-tls-key"

      + replication {
          + automatic = true
        }
    }

  # module.vault-deploy.google_secret_manager_secret_iam_member.vault-tls-cert will be created
  + resource "google_secret_manager_secret_iam_member" "vault-tls-cert" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.vault-deploy.google_secret_manager_secret_iam_member.vault-tls-key will be created
  + resource "google_secret_manager_secret_iam_member" "vault-tls-key" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.vault-deploy.google_secret_manager_secret_version.vault-tls-cert will be created
  + resource "google_secret_manager_secret_version" "vault-tls-cert" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.vault-deploy.google_secret_manager_secret_version.vault-tls-key will be created
  + resource "google_secret_manager_secret_version" "vault-tls-key" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.vault-deploy.google_service_account.vault will be created
  + resource "google_service_account" "vault" {
      + account_id   = "vault-sa"
      + disabled     = false
      + display_name = "Vault Service Account for KMS auto-unseal"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # module.vault-deploy.google_storage_bucket.vault will be created
  + resource "google_storage_bucket" "vault" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "GLOBAL"
      + name                        = "vault-jtcressy-net"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

  # module.vault-deploy.google_storage_bucket_iam_member.vault will be created
  + resource "google_storage_bucket_iam_member" "vault" {
      + bucket = "vault-jtcressy-net"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.vault-deploy.tls_cert_request.vault-cforigin-tls will be created
  + resource "tls_cert_request" "vault-cforigin-tls" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "vault.jtcressy.net"
          + country             = "US"
          + organization        = "jtcressy-net"
          + organizational_unit = "vault"
        }
    }

  # module.vault-deploy.tls_private_key.vault-cforigin-tls will be created
  + resource "tls_private_key" "vault-cforigin-tls" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

Plan: 17 to add, 0 to change, 0 to destroy.

Warning: Content-Type is not recognized as a text type, got "application/x-x509-ca-cert"

  with module.vault-deploy.data.http.cforigin-ca,
  on ../../modules/vault-deploy/cloudflare.tf line 25, in data "http" "cforigin-ca":
  25: data "http" "cforigin-ca" {

If the content is binary data, Terraform may not properly handle the contents
of the response.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.


```

</details>

*Pusher: @jtcressy, Action: `pull_request`, Workflow: `Terraform`, Context: `/layers/deploy/`*
<!-- created by terraform//layers/deploy//update-pull-request -->